testCase_of8/0/Df
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (10000 0 0 0 10000 0 0 0 10000);

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (10000 0 0 0 10000 0 0 0 10000);
    }
    symmetry_1
    {
        type            symmetryPlane;
    }
    symmetry_2
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            calculated;
        value           uniform (10000 0 0 0 10000 0 0 0 10000);
    }
    inlet
    {
        type            calculated;
        value           uniform (10000 0 0 0 10000 0 0 0 10000);
    }
}


// ************************************************************************* //
