testCase_of8/0/Ts
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ts;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 373;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    symmetry_1
    {
        type            symmetryPlane;
    }
    symmetry_2
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
      type         uniformFixedValue;
      uniformValue
      {
          type             tableFile;
          file             "time-series";
      }
    }
}


// ************************************************************************* //
