testCase_of8/0/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
11245
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    symmetry_1
    {
        type            symmetryPlane;
    }
    symmetry_2
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
}


// ************************************************************************* //
