testCase_of8/constant/pyrolysisProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

heterogeneousPyrolysisModel  volPyrolysis;

pyrolysisCoeffs
{
    filmCoupled     true;

    minimumDelta    1e-8;

    absorptionDepth 1;//0.085;
    emissionCoeff 1;

    viscosityDropFactor 1;
}

infoOutput      true;

// ************************************************************************* //
