testCase_of8/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       off;

heterogeneousRadiationModel  heterogeneousP1;

absorptionEmissionModel constantAbsorptionEmission;

noRadiation
{
}

heterogeneousP1Coeffs
{
}

heterogeneousMeanTempCoeffs
{
}

// Number of flow iterations per radiation iteration
solverFreq 1000;

heterogeneousAbsorptionEmissionModel heterogeneousConstantAbsorptionEmission;

heterogeneousConstantAbsorptionEmissionCoeffs
{
    a               a  [ 0 -1  0 0 0 0 0 ] 1e-2;
    as              as [ 0 -1  0 0 0 0 0 ] 200;
    borderAs        borderAs [ 0 -1  0 0 0 0 0 ] 200;
    e               e  [ 0 -1  0 0 0 0 0 ]  1e-2;
    es              es [ 0  -1  0 0 0 0 0 ] 0;
    borderEs        borderEs [ 0  -1  0 0 0 0 0 ] 0;
    E               E  [ 1 -1 -3 0 0 0 0 ] 0.0;
}

scatterModel    constantScatter;

constantScatterCoeffs
{
    sigma           sigma [ 0 -1 0 0 0 0 0 ] 0;
    C               C [ 0 0 0 0 0 0 0 ] 0;
}


// ************************************************************************* //
