testCase_of8/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    N2 CO2 CO O2 N2 tar CH4 H2 H2O
);

reactions
(
    //-- tar cracking --
	irreversibleArrheniusReaction
    tar  =  0.18 CO2 + 0.12 CH4 + 0.70 CO
   (4.26e6 0 12919) 

	// -- tar combustion --
	irreversibleArrheniusReaction
    tar + 0.678 O2 =  CO + 0.761 H2O
    (9.2e6 1 9650) 

	// -- methan combustion --
 	irreversibleArrheniusReaction
	CH4 + 1.5 O2 = CO + 2 H2O
 	(9.2e6 1 9650)
 	
	// -- carbon monoxide combustion --
	irreversibleArrheniusReaction
	2CO + O2 = 2 CO2
	(1.3e11 0 15105)

	// -- hydrogen combustion --
	irreversibleArrheniusReaction
	2H2 + O2 = 2H2O
	(10e11 0 10000) 
);

// ************************************************************************* //
