testCase_of8/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
     wood char ash 
);


woodCoeffs
{
    transport
    {
        K           .5;
        K0      .5;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.85;
    }
    thermodynamics
    {
        Cp          400;//1380;
        Hf          -1.04e6;
    }
    density
    {
        rho         360;
    }
};


charCoeffs
{
    transport
    {
        K           0.5;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.85;
    }
    thermodynamics
    {
        Cp          400;
        Hf          -2.12e4;
    }
    density
    {
        rho         300;
    }
};




humCoeffs
{
    transport
    {
	K0	    0.2;
	A	    0.0;
	K           0.58;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.17;
    }
    thermodynamics
    {
        Cp          4200;
        Hf         -15.86e6;
    }
    density
    {
        rho         1000;
    }
};

char1Coeffs
{
    transport
    {
        K           0.2;
	K0	    0.2;
	A	    0.0;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.17;
    }
    thermodynamics
    {
        Cp          1100;
        Hf          -2.12e4;
    }
    density
    {
        rho         1957;
    }
};
ashCoeffs
{
    transport
    {
        K           0.17;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.17;
    }
    thermodynamics
    {
        Cp          840;
        Hf          -12.38e6;
    }
    density
    {
        rho         2500;
    }
};
tarsolidCoeffs
{
    transport
    {
        K           0.5;
    }
    radiation
    {
        sigmaS      0.0;
        kappa       0.0;  //opaque
        emissivity  0.17;
    }
    thermodynamics
    {
        Cp          1380;
        Hf          -8.47e5;
    }
    density
    {
        rho         1200;
    }
};


// ************************************************************************* //
