testCase_of8/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default	cellLimited Gauss linear 1;
}

divSchemes
{
    default         Gauss upwind;//limitedLinear 1;
    /*div(phi)	    Gauss limitedLinear 1;
    div(phi,U)      Gauss limitedLinear 1;*/
    //div(phi,Yi_h)   Gauss limitedLinear 1;
    /*div(phi,hs)     Gauss limitedLinear 1;
    div(phiU,p)     Gauss limitedLinear 1;
	div(phiU,p_amb) Gauss limitedLinear 1;
    div(phid,p)     Gauss limitedLinear 1;
	div(phi,K)		Gauss limitedLinear 1;
//    div(phi,epsilon) Gauss limitedLinear 1;
//    div(phi,k) Gauss limitedLinear 1;*/
div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
   // div((muEff*dev2(grad(U).T()))) Gauss linear;  
//    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

fluxRequired
{
    default         no;
    phi;
    p;
    p_amb;
    pKin;
}


// ************************************************************************* //
