testCase_of8/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }


    rhoFinal
    {
        $rho;
    }


    "(p|p_amb|pKin)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-5;
        relTol           0.01;
    }


    "(p|p_amb|pKin)Final"
    {
        $p;
        relTol           0.0;
    }


    "(U|h|hs)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h|hs)Final"
    {
        $U;
		relTol          0;
    }

    "(Yi|Ys|porosity)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;

    }

    Ts
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           .01;
    }

    rhos
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          1e-02;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }

    GFinal
    {
        $p;
        relTol          0;
    }
    "(Yi|Ys)Final"
    {
        $UFinal;
    }

}


PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
}


PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
}

// *************************************************************************//

