testCase_of8/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
(
    volScalarFieldValue porosityF 1 
    volScalarFieldValue porosityF0 1
 
);

regions         
( 
	zoneToCell 
	{ 
		name "wood";
		fieldValues
		(
			volScalarFieldValue porosityF 0.5
			volScalarFieldValue porosityF0 0.5
		);
	}
);

// ************************************************************************* //
