testCase_of8/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;


geometry
{
    kule
    {	
        type closedTriSurfaceMesh;
        file "QuartetWrzesie.stl";
    }
	cylinder
	{
	    type searchableCylinder;
    point1 (0.5 0 4.32);
    point2 (0.81 0 4.65);
    radius 0.11;
    }
}	


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    maxLocalCells 1000000;

    maxGlobalCells 20000000;

    minRefinementCells 10;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 1;

    features
	(   
        {
          file "QuartetWrzesie.eMesh"; // file containing edge mesh
          level 2;               // level of refinement
        }	
	);

    refinementSurfaces
    {
		kule
   		{
			level (0 1);
		}

       
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        cylinder
		{
			levels ((1e15 2));
        	 mode inside;
		}
    }

    locationInMesh (0.1 0.1 1);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;

    tolerance 1.0;

    nSolveIter 150;

    nRelaxIter 15;

        nFeatureSnapIter 5;

        implicitFeatureSnap false;

        explicitFeatureSnap true;

        multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        cylinder
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.0;

    finalLayerThickness 0.001;

    minThickness 0.000001;

    nGrow 0;

    featureAngle 60;

    slipFeatureAngle 30;

    nRelaxIter 3;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);

mergeTolerance 1e-6;


// ************************************************************************* //
