testCase_of8/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    woodSet;
        type    cellSet;
        action  new;
        source boxToCell;
        sourceInfo
        {
            box (-5 -5 0.25)(5 5 3);
        }
    }
/*    {
        name    burningWoodSet;
        type    cellSet;
        action  new;
        source boxToCell;
        sourceInfo 
        {
            box (-5 -5 0)(5 5 0.1);
        }
    }*/
    {
        name    wood;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set woodSet; }
    }/*
    {
        name    burningWood;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set burningWoodSet; }
    }*/
);

// ************************************************************************* //
